{
  "questions" : [ {
    "id" : "1",
    "answertype" : "resource",
    "question" : [ {
      "string" : "What is the alma mater of the chancellor of Germany Angela Merkel?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "SELECT ?answer WHERE{ ?answer <http://dbpedia.org/property/actingViceChancellor> <http://dbpedia.org/resource/Alma_mater> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "number",
    "question" : [ {
      "string" : "How large is the area of UK?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "resource",
    "question" : [ {
      "string" : "Who is the author of the interpretation of dreams?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "string",
    "question" : [ {
      "string" : "What is the birth name of Adele?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "SELECT ?answer WHERE{<http://dbpedia.org/resource/Adele> <http://dbpedia.org/ontology/birthPlace> ?answer . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "resource" ]
      },
      "results" : {
        "bindings" : [ {
          "resource" : {
            "type" : "resource",
            "value" : "http://dbpedia.org/resource/Tottenham"
          }
        } ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "resource",
    "question" : [ {
      "string" : "What are the top selling luxury vehicle brands in Germany?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "SELECT ?answer WHERE{ ?answer <http://dbpedia.org/ontology/modelLineVehicle> <http://dbpedia.org/resource/Luxury_vehicle> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "number",
    "question" : [ {
      "string" : "how many awards has Bertrand Russell?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "string",
    "question" : [ {
      "string" : "Who is daniel jurafsky?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "number",
    "question" : [ {
      "string" : "When will start the final match of the football world cup 2018?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "SELECT ?answer WHERE{<http://dbpedia.org/resource/Association_football> ?property ?answer . FILTER ( datatype(?answer) = xsd:date )}"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "string",
    "question" : [ {
      "string" : "What is the difference between correlation and dependence?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "number",
    "question" : [ {
      "string" : "how much is the elevation of Düsseldorf Airport ?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "number",
    "question" : [ {
      "string" : "how much is the total population of  european union?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "number",
    "question" : [ {
      "string" : "when was the founding date of french fifth republic?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "string",
    "question" : [ {
      "string" : "Who are the founders of  BlaBlaCar?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "string",
    "question" : [ {
      "string" : "Who are the founding fathers of united states?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "string",
    "question" : [ {
      "string" : "how many foreigners speak German?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "resource",
    "question" : [ {
      "string" : "Where is the birthplace of Goethe?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?answer WHERE{<http://dbpedia.org/ontology/birthPlace> rdfs:range dbo:Place .<http://dbpedia.org/resource/Johann_Wolfgang_von_Goethe> <http://dbpedia.org/ontology/birthPlace> ?answer . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "resource" ]
      },
      "results" : {
        "bindings" : [ {
          "resource" : {
            "type" : "resource",
            "value" : "http://dbpedia.org/resource/Frankfurt"
          }
        }, {
          "resource" : {
            "type" : "resource",
            "value" : "http://dbpedia.org/resource/Holy_Roman_Empire"
          }
        }, {
          "resource" : {
            "type" : "resource",
            "value" : "http://dbpedia.org/resource/Frankfurt-am-Main"
          }
        } ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "string",
    "question" : [ {
      "string" : "Where is the origin of Carolina reaper?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "SELECT ?answer WHERE{<http://dbpedia.org/resource/Carolina_Reaper> <http://dbpedia.org/ontology/origin> ?answer . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "resource" ]
      },
      "results" : {
        "bindings" : [ {
          "resource" : {
            "type" : "resource",
            "value" : "http://dbpedia.org/resource/Fort_Mill,_South_Carolina"
          }
        } ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "number",
    "question" : [ {
      "string" : "How much is the population of mexico city ?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "string",
    "question" : [ {
      "string" : "what is the nick name of Baghdad?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "resource",
    "question" : [ {
      "string" : "Who is the novelist of the work a song of ice and fire?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "number",
    "question" : [ {
      "string" : "What is the percentage of area water in Brazil?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "SELECT ?answer WHERE{<http://dbpedia.org/resource/Brazil> <http://dbpedia.org/ontology/percentageOfAreaWater> ?answer . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "literal" ]
      },
      "results" : {
        "bindings" : [ {
          "literal" : {
            "type" : "literal",
            "value" : "0.65^^http://www.w3.org/2001/XMLSchema#float"
          }
        } ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "string",
    "question" : [ {
      "string" : "how much is the population  Iraq?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "string",
    "question" : [ {
      "string" : "What is the Sicilian pizza?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "number",
    "question" : [ {
      "string" : "What is the population of Cairo?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "SELECT ?answer WHERE{<http://dbpedia.org/resource/Cairo> <http://dbpedia.org/ontology/populationMetro> ?answer . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "literal" ]
      },
      "results" : {
        "bindings" : [ {
          "literal" : {
            "type" : "literal",
            "value" : "20439541^^http://www.w3.org/2001/XMLSchema#nonNegativeInteger"
          }
        } ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "number",
    "question" : [ {
      "string" : "how much is the population densty rank of germany?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "string",
    "question" : [ {
      "string" : "What is the relation between Resource Description Framework and Web Ontology Language?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "SELECT ?answer WHERE{ ?answer <http://dbpedia.org/ontology/relation> <http://dbpedia.org/resource/Resource_Description_Framework> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "number",
    "question" : [ {
      "string" : "how big is the total area of North Rhine- Westphalia?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "string",
    "question" : [ {
      "string" : "What is the original title of the interpretation of dreams?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "string",
    "question" : [ {
      "string" : "how many times the German football team won the world cup?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "string",
    "question" : [ {
      "string" : "Who are the writers of the Wall album of Pink Floyd?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "date",
    "question" : [ {
      "string" : "When was the death  of  Shakespeare?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "SELECT ?answer WHERE{<http://dbpedia.org/resource/William_Shakespeare> <http://dbpedia.org/ontology/deathYear> ?answer . FILTER ( (datatype(?answer) = xsd:date) || (datatype(?answer) = xsd:gYear)) }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "literal" ]
      },
      "results" : {
        "bindings" : [ {
          "literal" : {
            "type" : "literal",
            "value" : "1616^^http://www.w3.org/2001/XMLSchema#gYear"
          }
        } ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "string",
    "question" : [ {
      "string" : "With how many countries Iran has borders?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "resource",
    "question" : [ {
      "string" : "Where is Sungkyunkwan University?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "resource",
    "question" : [ {
      "string" : "What is the smallest city by area in Germany?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "SELECT ?answer WHERE{?answer rdf:type <http://dbpedia.org/ontology/ProtectedArea>. ?answer  <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Germany> . ?answer  <http://dbpedia.org/ontology/areaTotal> ?x . } ORDER BY ASC(?x) LIMIT 1 OFFSET 0"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "resource" ]
      },
      "results" : {
        "bindings" : [ {
          "resource" : {
            "type" : "resource",
            "value" : "http://dbpedia.org/resource/Nonnenmattweiher"
          }
        } ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "string",
    "question" : [ {
      "string" : "Which beer brewing comapnies are located in North-Rhine Westphalia?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "resource",
    "question" : [ {
      "string" : "What is the largest city in america?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "SELECT ?answer WHERE{?answer rdf:type <http://dbpedia.org/ontology/City>. ?answer  <http://dbpedia.org/ontology/areaTotal> ?x . } ORDER BY DESC(?x) LIMIT 1 OFFSET 0"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "resource" ]
      },
      "results" : {
        "bindings" : [ {
          "resource" : {
            "type" : "resource",
            "value" : "http://dbpedia.org/resource/Juazeiro"
          }
        } ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "string",
    "question" : [ {
      "string" : "Who is the current federal minister of finance in Germany?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "resource",
    "question" : [ {
      "string" : "What is the highest mountain in Saxony Germany?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "SELECT ?answer WHERE{?answer rdf:type <http://dbpedia.org/ontology/Mountain>. ?answer  <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/Saxony> . ?answer  <http://dbpedia.org/ontology/elevation> ?x . } ORDER BY DESC(?x) LIMIT 1 OFFSET 0"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "resource" ]
      },
      "results" : {
        "bindings" : [ {
          "resource" : {
            "type" : "resource",
            "value" : "http://dbpedia.org/resource/Fichtelberg"
          }
        } ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "string",
    "question" : [ {
      "string" : "Who wrote Thinking In Java? ( dose not exist in dbpedia)",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "string",
    "question" : [ {
      "string" : "Who is 8th president of US?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "resource",
    "question" : [ {
      "string" : "Where is the most deep point in the ocean?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "resource",
    "question" : [ {
      "string" : "In which state Penn State University is located?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "string",
    "question" : [ {
      "string" : "Which species does an elephant belong?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "resource",
    "question" : [ {
      "string" : "What is Donald Trump's main business?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "SELECT ?answer WHERE{ ?answer <http://dbpedia.org/ontology/mainFamilyBranch> <http://dbpedia.org/resource/Donald_Trump> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "resource",
    "question" : [ {
      "string" : "What is the last work of Dan Brown?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "SELECT ?answer WHERE{ ?answer <http://dbpedia.org/property/bssLastPosition> <http://dbpedia.org/resource/Dan_Brown> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "resource",
    "question" : [ {
      "string" : "What other books have been written by the author of The Fault in Our Stars?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : null
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "1",
    "answertype" : "date",
    "question" : [ {
      "string" : "When was the last episode of the TV series Friends aired?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "SELECT ?answer WHERE{<http://dbpedia.org/resource/Friends> ?property ?answer . FILTER ( datatype(?answer) = xsd:date )}"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "literal" ]
      },
      "results" : {
        "bindings" : [ {
          "literal" : {
            "type" : "literal",
            "value" : "2004-05-06^^http://www.w3.org/2001/XMLSchema#date"
          }
        }, {
          "literal" : {
            "type" : "literal",
            "value" : "1994-09-22^^http://www.w3.org/2001/XMLSchema#date"
          }
        } ]
      }
    } ]
  } ]
}